# EA_ConvStr2X

## Description
Converts string to X unit and returns the result as real number.

```pascal
FUNCTION EA_ConvStr2X(
				unitType : INTEGER;
				value    : STRING) : REAL;
```

```python

def vs.EA_ConvStr2X(unitType, value):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|unitType|INTEGER||
|value|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library